# 2024-05-28
### The homework code is below ###

name = 'Oleg'
print(f'Hello! My name is {name}.')
age = 40
print(f'I\'m {age} years old.')
age += 2
print(f'Excuse me! I\'m {age} years old.')
is_student = True
print(f'My learning status is equal to {is_student}.')

### End of the homework code ###


"""
=========================================================================================
=================================== HOMEWORK CONTENTS ===================================
=========================================================================================
2024-05-28

2023/09/23 00:00|Практическая работа по уроку "Динамическая типизация"
Практическая работа по уроку "Динамическая типизация"

Цель: Написать программу на языке Python, используя Pycharm, для демонстрации динамической типизации.

    В проекте, где вы решаете домашние задания, создайте модуль 'homework3.py' и напишите весь код в нём.


2. Создайте переменные разных типов данных:
  - Создайте переменную name и присвойте ей значение вашего имени (строка).
  - Выведите значение переменной name на экран.
  - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
  - Выведите значение переменной age на экран.
  - Перезапишите в age текущее значение переменной age + новое.
Как неверно (просто перезапись на новое число):
a = 15
a = 17
  - Выведите измененное значение переменной age на экран.
  - Создайте переменную is_student и присвойте ей значение True (логическое значение).
  - Выведите значение переменной is_student на экран.

Примечания:
- Для вывода значений на экран используйте функцию print().
- Обратите внимание на использование разных типов данных и возможности их изменения.

Пример результата выполнения программы:
Name: John
Age: 25
New Age: 26
Is Student: True

Файл с кодом (homework3.py) прикрепите к домашнему заданию.

Успехов!

"""